; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	satellite7 - satellite
	instrument16 - instrument
	infrared1 - mode
	spectrograph3 - mode
	thermograph0 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation4 - direction
	Star2 - direction
	Star3 - direction
	Star0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star0)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star2)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
	(supports instrument11 spectrograph3)
	(supports instrument11 infrared1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 Star2)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 spectrograph3)
	(calibration_target instrument13 Star2)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet7)
	(supports instrument14 spectrograph2)
	(supports instrument14 infrared1)
	(calibration_target instrument14 Star0)
	(supports instrument15 spectrograph3)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 Star3)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation4)
	(supports instrument16 spectrograph2)
	(supports instrument16 spectrograph3)
	(calibration_target instrument16 Star0)
	(on_board instrument16 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation4)
)
(:goal (and
	(pointing satellite3 Planet7)
	(pointing satellite5 Star6)
	(pointing satellite7 Star9)
	(have_image Phenomenon5 spectrograph3)
	(have_image Star6 infrared1)
	(have_image Planet7 spectrograph2)
	(have_image Phenomenon8 spectrograph3)
	(have_image Star9 infrared1)
	(have_image Star10 infrared1)
	(have_image Phenomenon11 spectrograph2)
))

)

; plan
1. (turn_to satellite5 star6 planet7)
   deleted: (pointing satellite5 planet7)
   added: (pointing satellite5 star6)
   goals met: 1 of 10
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 1 of 10
3. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 1 of 10
4. (turn_to satellite4 star9 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 star9)
   goals met: 1 of 10
5. (take_image satellite4 star9 instrument10 infrared1)
   added: (have_image star9 infrared1)
   goals met: 2 of 10
6. (turn_to satellite4 star6 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 star6)
   goals met: 2 of 10
7. (take_image satellite4 star6 instrument10 infrared1)
   added: (have_image star6 infrared1)
   goals met: 3 of 10
8. (turn_to satellite4 star10 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star10)
   goals met: 3 of 10
9. (turn_to satellite3 star2 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star2)
   goals met: 3 of 10
10. (take_image satellite4 star10 instrument10 infrared1)
   added: (have_image star10 infrared1)
   goals met: 4 of 10
11. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 4 of 10
12. (calibrate satellite3 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 4 of 10
13. (turn_to satellite3 phenomenon11 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 10
14. (take_image satellite3 phenomenon11 instrument7 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 5 of 10
15. (turn_to satellite3 phenomenon5 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon5)
   goals met: 5 of 10
16. (take_image satellite3 phenomenon5 instrument7 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 6 of 10
17. (turn_to satellite3 phenomenon8 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon8)
   goals met: 6 of 10
18. (take_image satellite3 phenomenon8 instrument7 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 7 of 10
19. (turn_to satellite3 planet7 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet7)
   goals met: 8 of 10
20. (take_image satellite3 planet7 instrument7 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 9 of 10
21. (turn_to satellite7 star9 groundstation4)
   deleted: (pointing satellite7 groundstation4)
   added: (pointing satellite7 star9)
   goals met: 10 of 10
